{
  "divisions" : {
    "division" : [ {
      "dname" : "Girls 10",
      "dcode" : "G10",
      "teams" : {
        "team" : [ {
          "tname" : "Susan",
          "tno" : "1"
        }, {
          "tname" : "Mike",
          "tno" : "2"
        } ]
      }
    } ]
  },
  "users" : {
    "-IsyoFh48mjNDLTGIvB_" : {
      "userid" : "100002666367904"
    },
    "-Isyo4Ozw_sxijoiZvXy" : {
      "userid" : "100002666367904"
    },
    "-IsysYz5ZfL_ZAkt3B5t" : {
      "userid" : "100002666367904",
      "content" : ""
    },
    "-Isys_WnO6zKbf17hi1G" : {
      "userid" : "100002666367904",
      "content" : ""
    },
    "-Isyo4Sbr2k-EgwZboNs" : {
      "userid" : "100002666367904"
    },
    "-Isyo4Le8GlsVbjnWINU" : {
      "userid" : "100002666367904"
    },
    "-IsysZ4y1aTQV1QDNDkL" : {
      "userid" : "100002666367904",
      "content" : ""
    },
    "-Isyo44rg2CxqStF_YDA" : {
      "userid" : "100002666367904"
    },
    "-Isyo48yr8k8qNEnR0xO" : {
      "userid" : "100002666367904"
    }
  },
  "genres" : {
    "genre" : [ {
      "movies" : {
        "movie" : [ {
          "mno" : "1",
          "description" : "Framed in the 1940s for the double murder of his wife and her lover, upstanding banker Andy Dufresne begins a new life at the Shawshank prison, where he puts his accounting skills to work for an amoral warden. During his long stretch in prison, Dufresne comes to be admired by the other inmates -- including an older prisoner named Red -- for his integrity and unquenchable sense of hope.",
          "mname" : "The Shawshank Redemption (1994)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/The%20Shawshank%20Redemption.jpg",
          "reviews" : {
            "review" : [ {
              "userid" : "123",
              "content" : "this is an example"
            }, {
              "userid" : "Sha Liu",
              "content" : "this is the second example"
            }, {
              "userid" : "Eng",
              "datelog" : "4/12/2013",
              "content" : "to test if there is a date"
            }, {
              "userid" : "Rose",
              "datelog" : "4/12/2013",
              "content" : "if there is time"
            }, {
              "userid" : "eee",
              "datelog" : "11:3:04/12/2013",
              "content" : "test is the time"
            }, {
              "userid" : "eee",
              "datelog" : "11:5:424/12/2013",
              "content" : "ffewfw"
            }, {
              "userid" : "eeee",
              "datelog" : "14:56:564-12-2013",
              "content" : "eee"
            }, {
              "userid" : "rrr",
              "datelog" : "14:57:56 4-12-2013",
              "content" : "eee"
            }, {
              "userid" : "sliu32",
              "datelog" : "18:12:24 4-12-2013",
              "content" : "how do you think it."
            }, {
              "userid" : "SSS",
              "datelog" : "21:1:0 4-12-2013",
              "content" : "EXAMPLE"
            }, {
              "userid" : "SDA",
              "datelog" : "21:1:20 4-12-2013",
              "content" : "REWRWERWE"
            }, {
              "userid" : "Sha",
              "datelog" : "10:58:33 4-17-2013",
              "content" : "This is the test."
            }, {
              "userid" : "Sha  Liu",
              "datelog" : "22:25:17 4-24-2013",
              "content" : ""
            }, {
              "userid" : "Sha  Liu",
              "rate" : "4",
              "datelog" : "10:22:52 4-25-2013",
              "content" : "My review here"
            }, {
              "userid" : "Sha  Liu",
              "rate" : "4",
              "datelog" : "10:45:52 4-25-2013",
              "content" : "best of all"
            } ]
          }
        }, {
          "mno" : "2",
          "description" : "The story spans the years from 1945 to 1955 and chronicles the fictional Italian-American Corleone crime family. When organized crime family patriarch Vito Corleone barely survives an attempt on his life, his youngest son, Michael, steps in to take care of the would-be killers, launching a campaign of bloody revenge.",
          "mname" : "The God Father (1972)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/GodFather.jpg",
          "reviews" : {
            "review" : [ {
              "userid" : "345",
              "content" : "the best movie of gangstas i love it"
            }, {
              "userid" : "Sha",
              "content" : "This is an exmaple comment"
            }, {
              "userid" : "Yueming",
              "content" : "WOW! I can't even review is film without saying that The Godfather is the most epic movie you will ever witness."
            }, {
              "userid" : "Jack",
              "content" : "This movie has the greatest graphics I have ever seen in my life."
            }, {
              "userid" : "Monica",
              "content" : "This movie really impressed me!"
            }, {
              "userid" : "Sha",
              "content" : "testit"
            }, {
              "userid" : "Joey",
              "content" : "Hello, there"
            }, {
              "userid" : "Sha  Liu",
              "content" : "write my comment"
            }, {
              "userid" : "Sha  Liu",
              "rate" : "5",
              "content" : "first score"
            }, {
              "userid" : "Sha  Liu",
              "rate" : "4",
              "content" : "rerewr"
            }, {
              "userid" : "Sha  Liu",
              "rate" : "5",
              "content" : "check it"
            }, {
              "userid" : "Sha  Liu",
              "rate" : "4",
              "datelog" : "12:22:3 4-25-2013",
              "content" : "this is"
            } ]
          }
        }, {
          "mno" : "3",
          "description" : "Enraged at the slaughter of Murron, his new bride and childhood love, legendary Scottish warrior William Wallace slays a platoon of the local English lord's soldiers. This leads the village to revolt and, eventually, the entire country to rise up against English rule.",
          "mname" : "Braveheart (1995)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/Braveheart.jpg",
          "reviews" : {
            "review" : [ {
              "userid" : "Jim",
              "content" : "A Kick-ass story and one of the best theme tunes of all time, Braveheart truly masters the art of re-making history and does so in a fashion that will put you on the edge of your seat. BRAVO!"
            } ]
          }
        }, {
          "mno" : "4",
          "description" : "A man with a low IQ has accomplished great things in his life and been present during significant historic events - in each case, far exceeding what anyone imagined he could do. Yet, despite all the things he has attained, his one true love eludes him. \"Forrest Gump\" is the story of a man who rose above his challenges, and who proved that determination, courage, and love are more important than ability.",
          "mname" : "Forrest Gump (1994)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/ForrestGump.jpg"
        }, {
          "mno" : "5",
          "description" : "Frank W. Abagnale Jr. is a cunning con man -- posing as a doctor, lawyer and pilot all before turning 21. He's also a deft forger, and his work attracts the attention of FBI agent Carl Hanratty, who makes it his mission to put Frank behind bars. But Frank not only eludes capture, he revels in the pursuit, even taking time to taunt Carl by phone.",
          "mname" : "Catch Me If You Can (2002)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/CatchMeIfYouCan(2002).jpg"
        } ]
      },
      "gname" : "Drama"
    }, {
      "movies" : {
        "movie" : [ {
          "mno" : "1",
          "description" : "Dom Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious.",
          "mname" : "Inception (2010)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/Inception(2010).jpg"
        }, {
          "mno" : "2",
          "description" : "When an unexpected enemy emerges and threatens global safety and security, Nick Fury, director of the international peacekeeping agency known as S.H.I.E.L.D., finds himself in need of a team to pull the world back from the brink of disaster. Spanning the globe, a daring recruitment effort begins!",
          "mname" : "The Avengers (2012)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/TheAvengers(2012).jpg"
        }, {
          "mno" : "3",
          "description" : "Robert Neville is a scientist who was unable to stop the spread of the terrible virus that was incurable and man-made. Immune, Neville is now the last human survivor in what is left of New York City and perhaps the world. For three years, Neville has faithfully sent out daily radio messages, desperate to find any other survivors who might be out there. But he is not alone.",
          "mname" : "I Am Legend (2007)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/IAmLegend(2007).jpg"
        }, {
          "mno" : "4",
          "description" : "A semi-biographical account of Yip Man, the first martial arts master to teach the Chinese martial art of Wing Chun. The film focuses on events surrounding Ip that took place in the city of Foshan between the 1930s to 1940s during the Second Sino-Japanese War. Directed by Wilson Yip, the film stars Donnie Yen in the lead role, and features fight choreography by Sammo Hung.",
          "mname" : "Ip Man (2008)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/IpMan(2008).jpg"
        }, {
          "mno" : "5",
          "description" : "Los Angeles SWAT cop Jack Traven is up against bomb expert Howard Payne, who's after major ransom money. First it's a rigged elevator in a very tall building. Then it's a rigged bus--if it slows, it will blow, bad enough any day, but a nightmare in LA traffic. And that's still not the end.",
          "mname" : "Speed (1994)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/Speed.jpg"
        }, {
          "mno" : "6",
          "description" : "Chan Wing Yan, a young police officer, has been sent undercover as a mole in the local mafia. Lau Kin Ming, a young mafia member, infiltrates the police force. Years later, their older counterparts, Chen Wing Yan and Inspector Lau Kin Ming, respectively, race against time to expose the mole within their midst.",
          "mname" : "Infernal Affairs",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/InfernalAffairs.jpg"
        }, {
          "mno" : "7",
          "description" : "Against his father Odin's will, The Mighty Thor -a powerful but arrogant warrior god -recklessly reignites an ancient war. Thor is cast down to Earth and forced to live among humans as punishment. Once here, Thor learns what it takes to be a true hero when the most dangerous villain of his world sends the darkest forces of Asgard to invade Earth.",
          "mname" : "Thor (2011)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/Thor(2011).jpg"
        } ]
      },
      "gname" : "Action"
    }, {
      "movies" : {
        "movie" : [ {
          "mno" : "1",
          "description" : "When she learns she's in danger of losing her visa status and being deported, overbearing book editor Margaret Tate forces her put-upon assistant, Andrew Paxton, to marry her.",
          "mname" : "The Proposal (2009)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/TheProposal(2009).jpg"
        } ]
      },
      "gname" : "Comedy"
    }, {
      "movies" : {
        "movie" : [ {
          "mno" : "1",
          "description" : "When guardian angel Seth -- who invisibly watches over the citizens of Los Angeles -- becomes captivated by Maggie, a strong-willed heart surgeon, he ponders trading in his pure, otherworldly existence for a mortal life with his beloved. The couple embarks on a tender but forbidden romance spanning heaven and Earth.",
          "mname" : "City of Angels (1998)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/CityofAngels(1998).jpg"
        } ]
      },
      "gname" : "Romance"
    }, {
      "movies" : {
        "movie" : [ {
          "mno" : "1",
          "description" : "After a lifetime of dreaming of traveling the world, 78-year-old homebody Carl flies away on an unbelievable adventure with Russell, an 8-year-old Wilderness Explorer, unexpectedly in tow. Together, the unlikely pair embarks on a thrilling odyssey full of jungle beasts and rough terrain.",
          "mname" : "Up (2009)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/Up(2009).jpg"
        }, {
          "mno" : "2",
          "description" : "Woody the cowboy is young Andy’s favorite toy. Yet this changes when Andy get the new super toy Buzz Lightyear for his birthday. Now that Woody is no longer number one he plans his revenge on Buzz. Toy Story is a milestone in film history for being the first feature film to use entirely computer animation.",
          "mname" : "Toy Story (1995)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/ToyStory(1995).jpg"
        }, {
          "mno" : "3",
          "description" : "When Sophie, a shy young woman, is cursed with an old body by a spiteful witch, her only chance of breaking the spell lies with a self-indulgent yet insecure young wizard and his companions in his legged, walking home.",
          "mname" : "Howl's Moving Castle (2004)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/Howl'sMovingCastle(2004).jpg"
        }, {
          "mno" : "4",
          "description" : "Manny, Diego, and Sid embark upon another adventure after their continent is set adrift. Using an iceberg as a ship, they encounter sea creatures and battle pirates as they explore a new world.",
          "mname" : "Ice Age: Continental Drift (2012)",
          "image" : "http://tinman.cs.gsu.edu/~sliu15/p5/images/IceAge4.jpg"
        } ]
      },
      "gname" : "Animation"
    } ]
  }
}
